[
  "Buy the meal of the person behind you in the next drive-thru you visit",
  "Pray regularly this week for the leader of your church/small group/community group and then ask how you can serve them.",
  "Have a “homeless” international over to your home for Thanksgiving. ",
  "Prepare and have a meal with someone who has just had a new baby.",
  "Pick a favorite place to go and invite a few colleagues after work for drinks, listen to THEIR story. ",
  "Invite a family to dinner.",
  "Have a day after Thanksgiving leftover party. Invite neighbors to bring their leftovers on Friday or Saturday and give thanks for having such a cool neighbors",
  "Invite someone into your small group.",
  "\"Check-In\" on Facebook at a coffee shop and invite anyone to join you. ",
  "Offer a couple open seats at your table for Thanksgiving on MyRock.",
  "Visit families on a regular basis (I'm talking about people you are not too familiar with)/ take them out/ include them in your regular lives.  ",
  "Purchase Bus passes/ Gift Cards for single moms/ dads or families in fixed income housing.",
  "Start a meal train for single moms, families, families with newborns….but to eat the meal with them…not just drop it off.",
  "Provide rides to church on a regular basis or other activities happening at church.",
  "Host people for housing for not just a night but for weeks or months if needed",
  "Babysit kids so parents/ single parents have a night off",
  "Be a mentor and spend time with their kids/ take the kids out",
  "Practice conversational English with an international",
  "Help an international fill out paperwork for employment, visas, citizenships",
  "Be willing to meet someone new everyday and have a meaningful conversation with them.",
  "Advocate for someone in need",
  "Serve on the Highrock Welcome Team (twice a month) during Sunday services in order to make Highrock a more hospitable place for others.",
  "Serve in the church kitchen (once a month) preparing snacks and drinks during Sunday services as a way to help create a more hospitable environment for others after service ends.",
  "Look for ways you can serve with kids during Sunday services."
]