[
  "Buy the meal of the person behind you in the next drive-thru you visit",
  "Pray regularly this week for the leaders of your church / small group / ministry and then ask how you can serve them.",
  "Organize your family, a group of friends, or your small group to serve one Friday at Ann’s Dinner.",
  "Prepare and have a meal with someone who has just had a new baby.",
  "Pick a favorite place to go and invite a few colleagues after work for drinks, listen to THEIR story. ",
  "Invite a family to dinner.",
  "Become knowledgeable about the global refugee crisis by reading A Better Country by Cindy Wu.",
  "Invite someone into your small group.",
  "\"Check-In\" on Facebook at a coffee shop and invite anyone to join you. ",
  "Offer a couple open seats at your table for Thanksgiving on MyRock.",
  "Visit families on a regular basis (I'm talking about people you are not too familiar with)/ take them out/ include them in your regular lives.  ",
  "Purchase gift cards for single moms and dads or families in fixed income housing.",
  "Start a meal train for single moms, families, families with newborns….but to eat the meal with them…not just drop it off.",
  "Provide rides to church on a regular basis or other activities happening at church.",
  "Host people for housing for not just a night but for weeks or months if needed",
  "Babysit kids so parents/ single parents have a night off",
  "Be a mentor and spend time with their kids/ take the kids out",
  "Practice conversational English with an international",
  "Help an international fill out paperwork for employment, visas, citizenships",
  "Be willing to meet someone new everyday and have a meaningful conversation with them.",
  "Advocate for someone in need",
  "Serve on the Highrock Welcome Team (twice a month) during Sunday services in order to make Highrock a more hospitable place for others.",
  "Serve on the Highrock hospitality team preparing snacks and drinks for Sunday services as a way to help create a more hospitable environment for others after service ends.",
  "Look for ways you can serve with kids during Sunday services.",
  "Learn about your ethnic identity and how to step beyond prejudice by reading Beyond Colorblind by Highrocker Sarah Shin."
]